<a href="https://colab.research.google.com/github/m-nganga/SQL-4-DS-Dojo/blob/master/SQL_Joins_for_Data_Analysis_and_Reporting.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SQL Joins for Data Analysis and Reporting

## Overview

A Study of SQL Joins.

## Useful Information

We have three datasets;   
1. Customer dataset with 10 customer records.
2. Customer addresses... a separate dataset (which ideally could have been part of the customer dataset) for the sake of learning.
3. Transactions dataset which is a record of all transactions carried out by different customers.

## Step 1. Pre-requisites

In [1]:
# Importing pandas library which will help in reading of data from an external 
#source as well and its manipulation.
import pandas as pd

# Loading SQL extension which will allow us to run SQL code in our Notebook.
%load_ext sql

# Connecting to an in memory SQLite database within colaboratory
%sql sqlite://

'Connected: @None'

## Step 2. Preparing Datasets

### Step 2.1 Importing Datasets

The dataset on customer

In [42]:
# Load the customer demographic dataset from an external csv file and store it in a dataframe called customer
customer = pd.read_csv('customer_demographics.csv', sep=',', encoding='latin-1')

#Store the dataset in our in memory sqlite database. but for controls, check 
#first if the table exists in the database, and if so drop it. 
%sql DROP TABLE if EXISTS customer

#Finally create an SQL table of our sqlite database and store 
#the recordset in readiness for further analysis with SQL 
%sql PERSIST customer;

 * sqlite://
Done.
 * sqlite://

'Persisted customer'

The dataset on customer addresses

In [43]:
# Load the customer address dataset from an external csv file and store it in a dataframe "address"
address = pd.read_csv('customer_address.csv')

#check for table existence and drop it accordingly.
%sql DROP TABLE if EXISTS address;

#Finally create an SQL table in the sqlite database running in memory and store 
#the recordset in readiness for further analysis with SQL 
%sql PERSIST address;

 * sqlite://
Done.
 * sqlite://

'Persisted address'

The dataset on customer transactions

In [44]:
# Load the customer transactions dataset from an external csv file and store it in a dataframe "transactions"
transactions = pd.read_csv('transactions.csv')

#check for table existence and drop it accordingly.
%sql DROP TABLE if EXISTS transactions;

#Finally create an SQL table in the sqlite database running in memory and store 
#the recordset in readiness for further analysis with SQL 
%sql PERSIST transactions;

 * sqlite://
Done.
 * sqlite://

'Persisted transactions'

### Step 2.2 Sampling Recordset

In [45]:
# Sampling the first few records for each of the datasets created in order to 
# understand their structure.

# head() function for the weather dataframe and the SQL query with 
# a LIMIT condition for the cab_rides dataset.

#customer.head(11)      #use the dataframe instead
%sql SELECT * FROM customer LIMIT 10

 * sqlite://
Done.

[(0, 1, 'Laraine', 'Medendorp', 'F', 93, '10/12/1953', 'Executive Secretary', 'Health', 'Mass Customer', 'N', '"\'', 'Yes', 11),
 (1, 2, 'Eli', 'Bockman', 'Male', 81, '12/16/1980', 'Administrative Officer', 'Financial Services', 'Mass Customer', 'N', "<script>alert('hi')</script>", 'Yes', 16),
 (2, 3, 'Arlin', 'Dearle', 'Male', 61, '1/20/1954', 'Recruiting Manager', 'Property', 'Mass Customer', 'N', '1-Feb', 'Yes', 15),
 (3, 4, 'Talbot', None, 'Male', 33, '10/3/1961', None, 'IT', 'Mass Customer', 'N', '() { _; } >_[$($())] { touch /tmp/blns.shellshock2.fail; }', 'No', 7),
 (4, 5, 'Sheila-kathryn', 'Calton', 'Female', 56, '5/13/1977', 'Senior Editor', None, 'Affluent Customer', 'N', 'NIL', 'Yes', 8),
 (5, 6, 'Curr', 'Duckhouse', 'Male', 35, '9/16/1966', None, 'Retail', 'High Net Worth', 'N', 'ðµ ð ð ð', 'Yes', 13),
 (6, 7, 'Fina', 'Merali', 'Female', 6, '2/23/1976', None, 'Financial Services', 'Affluent Customer', 'N', 'â°â´âµâââ', 'Yes', 11),
 (7, 8, 'Rod', 'Inder', 'Male', 31, '3/30/1962', 'Media Manager I', None, 'Mass Customer', 'N', '(â¯Â°â¡Â°ï¼â¯ï¸µ â»ââ»)', 'No', 7),
 (8, 9, 'Mala', 'Lind', 'Female', 97, '3/10/1973', 'Business Systems Development Analyst', 'Argiculture', 'Affluent Customer', 'N', '0/0', 'Yes', 8),
 (9, 10, 'Fiorenze', 'Birdall', 'Female', 49, '10/11/1988', 'Senior Quality Engineer', 'Financial Services', 'Mass Customer', 'N', 'ð©ð½', 'Yes', 20)]

In [46]:
%sql SELECT * FROM address LIMIT 10

 * sqlite://
Done.

[(0, 1, '060 Morning Avenue', 2016, 'New South Wales', 'Australia', 10),
 (1, 2, '6 Meadow Vale Court', 2153, 'New South Wales', 'Australia', 10),
 (2, 3, '2 Sutherland Street', 3799, 'VIC', 'Australia', 6),
 (3, 4, '0 Holy Cross Court', 4211, 'QLD', 'Australia', 9),
 (4, 5, '17979 Del Mar Point', 2448, 'New South Wales', 'Australia', 4),
 (5, 6, '9 Oakridge Court', 3216, 'VIC', 'Australia', 9),
 (6, 7, '4 Delaware Trail', 2210, 'New South Wales', 'Australia', 9),
 (7, 8, '49 Londonderry Lane', 2650, 'New South Wales', 'Australia', 4)]

In [47]:
%sql SELECT * FROM transactions

 * sqlite://
Done.

[(0, 1, 2, 2, '2/25/2017', 0, 'Approved', 'Solex', 'Standard', 'medium', 'medium', 71.49, '$53.62', 41245),
 (1, 2, 3, 2, '5/21/2017', 1, 'Approved', 'Trek Bicycles', 'Standard', 'medium', 'large', 2091.47, '$388.92', 41701),
 (2, 3, 37, 6, '10/16/2017', 0, 'Approved', 'OHM Cycles', 'Standard', 'low', 'medium', 1793.43, '$248.82', 36361),
 (3, 4, 88, 4, '8/31/2017', 0, 'Approved', 'Norco Bicycles', 'Standard', 'medium', 'medium', 1198.46, '$381.10', 36145),
 (4, 5, 78, 6, '10/1/2017', 1, 'Approved', 'Giant Bicycles', 'Standard', 'medium', 'large', 1765.3, '$709.48', 42226),
 (5, 6, 25, 6, '3/8/2017', 1, 'Approved', 'Giant Bicycles', 'Road', 'medium', 'medium', 1538.99, '$829.65', 39031),
 (6, 7, 22, 6, '4/21/2017', 1, 'Approved', 'WeareA2B', 'Standard', 'medium', 'medium', 60.34, '$45.26', 34165),
 (7, 8, 15, 8, '7/15/2017', 0, 'Approved', 'WeareA2B', 'Standard', 'medium', 'medium', 1292.84, '$13.44', 39915),
 (8, 9, 12, 10, '8/30/2017', 1, 'Approved', 'WeareA2B', 'Standard', 'medium', 'medium', 1231.15, '$161.60', 38216),
 (9, 10, 5, 11, '1/17/2017', 0, 'Approved', 'Trek Bicycles', 'Mountain', 'low', 'medium', 574.64, '$459.71', 40784)]

## Step 3. SQL Joins
Use SQL Joins to return matching records from the above.

**1. List of all registered customers who have made purchases**

In [71]:
#INNER JOIN DEMONSTATION 
#A record of all records common to customer table as well as transactions  table

%%sql 
SELECT distinct c.*
FROM customer c
JOIN transactions t
ON c.customer_id = t.customer_id

 * sqlite://
Done.

[(1, 2, 'Eli', 'Bockman', 'Male', 81, '12/16/1980', 'Administrative Officer', 'Financial Services', 'Mass Customer', 'N', "<script>alert('hi')</script>", 'Yes', 16),
 (3, 4, 'Talbot', None, 'Male', 33, '10/3/1961', None, 'IT', 'Mass Customer', 'N', '() { _; } >_[$($())] { touch /tmp/blns.shellshock2.fail; }', 'No', 7),
 (5, 6, 'Curr', 'Duckhouse', 'Male', 35, '9/16/1966', None, 'Retail', 'High Net Worth', 'N', 'ðµ ð ð ð', 'Yes', 13),
 (7, 8, 'Rod', 'Inder', 'Male', 31, '3/30/1962', 'Media Manager I', None, 'Mass Customer', 'N', '(â¯Â°â¡Â°ï¼â¯ï¸µ â»ââ»)', 'No', 7),
 (9, 10, 'Fiorenze', 'Birdall', 'Female', 49, '10/11/1988', 'Senior Quality Engineer', 'Financial Services', 'Mass Customer', 'N', 'ð©ð½', 'Yes', 20)]

<em><font color = lightblue>Only customers 2, 4, 6, 8 and 10 meet this condition.</font> </em>



---

**2. List customers in the transactions recordset who are not registered. (ideally this should not happen as transations table is a secondary table based on the customers records in the first place. The data has been organised this way for the sake of learning.) We only expect one record; customer record ID 11**

In [59]:
# LEFT OUTER JOIN WITH A WHERE CONDITION
# Return all the records which are not in the table on the left of the JOIN.
#This is similar to the RIGHT OUTER JOIN with a condition of Null for the table on the right of JOIN.

%%sql 
SELECT t.*
FROM transactions t
LEFT JOIN customer c
ON c.customer_id = t.customer_id
WHERE c.customer_id isNULL

 * sqlite://
Done.

[(9, 10, 5, 11, '1/17/2017', 0, 'Approved', 'Trek Bicycles', 'Mountain', 'low', 'medium', 574.64, '$459.71', 40784)]

**3. List customers whose addresses are missing**

In [ ]:
#LEFT OUTER JOIN DEMONSTATION
# Return all the records which are not in the table on the right of the JOIN.

%sql 
SELECT c.*
FROM customer c
LEFT JOIN address a
ON c.customer_id = a.customer_id
WHERE a.customer_id isNULL

 * sqlite://
Done.

[(8, 9, 'Mala', 'Lind', 'Female', 97, '3/10/1973', 'Business Systems Development Analyst', 'Argiculture', 'Affluent Customer', 'N', '0/0', 'Yes', 8),
 (9, 10, 'Fiorenze', 'Birdall', 'Female', 49, '10/11/1988', 'Senior Quality Engineer', 'Financial Services', 'Mass Customer', 'N', 'ð©ð½', 'Yes', 20)]

**4. List customers who have not had purchases at all**

In [ ]:
#LEFT OUTER JOIN IMPLEMENTATION 
%%sql 
SELECT c.*
FROM customer c
LEFT JOIN transactions t
ON c.customer_id = t.customer_id
WHERE t.customer_id isNULL

 * sqlite://
Done.

[(0, 1, 'Laraine', 'Medendorp', 'F', 93, '10/12/1953', 'Executive Secretary', 'Health', 'Mass Customer', 'N', '"\'', 'Yes', 11),
 (2, 3, 'Arlin', 'Dearle', 'Male', 61, '1/20/1954', 'Recruiting Manager', 'Property', 'Mass Customer', 'N', '1-Feb', 'Yes', 15),
 (4, 5, 'Sheila-kathryn', 'Calton', 'Female', 56, '5/13/1977', 'Senior Editor', None, 'Affluent Customer', 'N', 'NIL', 'Yes', 8),
 (6, 7, 'Fina', 'Merali', 'Female', 6, '2/23/1976', None, 'Financial Services', 'Affluent Customer', 'N', 'â°â´âµâââ', 'Yes', 11),
 (8, 9, 'Mala', 'Lind', 'Female', 97, '3/10/1973', 'Business Systems Development Analyst', 'Argiculture', 'Affluent Customer', 'N', '0/0', 'Yes', 8)]



---

<br><em><font color = lightblue>Important: </em>RIGHT and FULL OUTER JOINs are not currently supported.  </font>

however, if they were to be implemented, they would follow  hte same syntax af for the LEFT JOIN but replacing Left with RIGHT JOIN.



---

<br><em><font color = lightblue size=2>Note: Data sets used in this notebook are obtained with the permission from KPMG, an Australian partnership and a member firm of the KPMG network of independent member firms affiliated with KPMG International Cooperative (“KPMG International”), a Swiss entity and used for KPMG Virtual Internship learning purposes only.</em></font>